'''
M시간 후 남아 있는 미생물 수의 총합
# 약품에 닿으면,
(1) 미생물 수 : 미생물 수//2
(2) 방향 : 반대
# 군집이 만나면,
(1) 미생물 수 : 군집합
(2) 방향 : 가장 미생물이 많은 군집
'''
# 입력받기
N, M, K = map(int, input().split()) # N:셀의개수 M:격리시간 K:미생물군집의개수
arr = [[[0, 0] for _ in range(N)] for _ in range(N)]

for k in range(K):
    y, x, mic, d = map(int, input().split())
    arr[y][x][0] = k
    arr[y][x][1] = k
'''
[[[0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0]], 
[[0, 0], [7, 1], [0, 0], [0, 0], [0, 0], [8, 2], [0, 0]], 
[[0, 0], [7, 1], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0]], 
[[0, 0], [0, 0], [8, 4], [0, 0], [3, 3], [100, 1], [0, 0]], 
[[0, 0], [0, 0], [0, 0], [14, 1], [0, 0], [0, 0], [0, 0]], 
[[0, 0], [5, 4], [0, 0], [0, 0], [0, 0], [1, 1], [0, 0]], 
[[0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0], [0, 0]]]
'''

dy = [-1, 1, 0, 0]
dx = [0, 0, -1, 1]
def move(y, x, direct):
    ny = y + dy[direct]
    nx = x + dx[direct]
    if 0 <= ny < N and 0 <= nx < N:
        if arr[ny][nx][0] != 0:

        arr[y][x], arr[ny][nx] = arr[ny][nx], arr[y][x]
    return

for m in range(M):
    for y in range(N):
        for x in range(N):
            if arr[y][x][1] == 1:
                move(y, x, 0)
            elif arr[y][x][1] == 2:
                move(y, x, 1)
            elif arr[y][x][1] == 3:
                move(y, x, 2)
            elif arr[y][x][1] == 4:
                move(y, x, 3)




















'''
7 2 9
1 1 7 1
2 1 7 1
5 1 5 4
3 2 8 4
4 3 14 1
3 4 3 3
1 5 8 2
3 5 100 1
5 5 1 1
'''
